<div style="text-align: center; font-family: 'Times New Roman', Times, serif; background-color: #f5f5f5; padding: 20px; border-radius: 10px; box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);">

  <h1 style="color: #333; text-decoration: underline;">Python</h1>
  <h1 style="color: #333; text-decoration: underline;">Machine Learning</h1>
  <div style="font-style: italic; margin-top: 10px; color: #555;">Notebook Author: Shahzaib Yaqoob</div>
  <div style="font-weight: bold; margin-top: 5px; color: #555;">Gmail: shahzaibmalik4488@gmail.com</div>
  <p style="margin-top: 20px; color: #777;">Welcome to the world of Python and Machine Learning! Feel free to explore and innovate.</p>
  
  <!-- Navigation Links -->
  <div style="margin-top: 20px;">
    <a href="#tutorials" style="color: #555; margin-right: 20px;">Tutorials</a>
    <a href="#resources" style="color: #555; margin-right: 20px;">Resources</a>
    <a href="#examples" style="color: #555;">Examples</a>
  </div>

  <!-- Code Snippet -->
  <div style="margin-top: 20px;">
    <code style="background-color: #ddd; padding: 5px; color:#555">print("Hello, Python and Machine Learning!")</code>
  </div>

  <!-- Social Media Links -->
  <div style="margin-top: 20px;">
    <a href="https://github.com/shahzaiby" style="color: #555; margin-right: 20px;">GitHub</a>
    <a href="https://www.linkedin.com/in/shahzaibyaqoob/" style="color: #555; margin-right: 20px;">LinkedIn</a>
    <a href="https://twitter.com/shahzaib" style="color: #555;">Twitter</a>
  </div>

  <!-- Additional Styling -->
  <style>
    /* Add your additional styling here */
    a:hover {
      text-decoration: underline;
    }
  </style>

  <!-- Footer -->
  <div style="margin-top: 20px; color: #555;">
    &copy; 2023 Shahzaib Yaqoob. All rights reserved.
  </div>
  
</div>

<h1 align="center" style="font-family: 'Times New Roman';">Data Inconsistencies</h1>

# 1. Inconsistent Formats:

## **Issue:**
Imagine writing dates differently, like "12th January" and "January 12th."

## **Example Solution:**
Pick one style, say "January 12, 2023," and stick to it across all your writing.

---

# 2. Naming Convention Issues:

## **Issue:**
You refer to the United States as "USA" in one document or database, and as "United States of America" in another.

## **Example Solution:**
Decide on one name and use it consistently, so everyone knows who you're talking about.

---

# 3. Typographical Errors:

## **Issue:**
Imagine texting "Pakistan" but accidentally typing "Paakistan."

## **Example Solution:**
Use tools that catch mistakes or double-check your writing to fix any errors.

---

# 4. Duplication of Data:

## **Issue:**
Having the same contact twice in your phone with different details.

## **Example Solution:**
Give each contact a unique name or ID, and regularly check for and merge duplicates.

---

# 5. Contradictory Data:

## **Issue:**
If your friend says they live downtown, but their address online says uptown.

## **Example Solution:**
Have one reliable source for information, like asking your friend directly, to avoid conflicting details.

---
---

<h1 align="Center" style="font-family:'Times New Roman';"> Code</h1>

# Import Libraries

In [168]:
import pandas as pd

# How to format dates in Python

In [169]:
data = {
    'date': ['2022-12-01', '01-12-2023', '2024/12/01', '12-01-2019'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Shahzaib', 'shaahzaib', 'yaqob', 'Yaqoob'],
    'sales_2020': [200, 300, None, 400],
    'sales_2021': [None, 250, 400, 250]
}

# Make a Pandas DataFrame
df_data = pd.DataFrame(data)
df_data.head(5)

         date        country       name  sales_2020  sales_2021
0  2022-12-01            USA   Shahzaib       200.0         NaN
1  01-12-2023         U.S.A.  shaahzaib       300.0       250.0
2  2024/12/01        America      yaqob         NaN       400.0
3  12-01-2019  United States     Yaqoob       400.0       250.0

This parameter handles conversion errors. When set to 'coerce', it replaces parsing errors with NaT values and 
it also convert all the dates into standard format

## **Inconsistent Formats**

In [170]:
df_data['date']=pd.to_datetime(df_data['date'],errors='coerce')
df_data['date']

0   2022-12-01
1          NaT
2          NaT
3          NaT
Name: date, dtype: datetime64[ns]

 It replace 'NAT' with Nan

In [171]:
df_data['date']=df_data['date'].dt.strftime( '%Y-%m-%d')

In [172]:
df_data['date']=df_data['date'].fillna("Year-Month-day")
df_data['date']

0        2022-12-01
1    Year-Month-day
2    Year-Month-day
3    Year-Month-day
Name: date, dtype: object

In [173]:
df_data

             date        country       name  sales_2020  sales_2021
0      2022-12-01            USA   Shahzaib       200.0         NaN
1  Year-Month-day         U.S.A.  shaahzaib       300.0       250.0
2  Year-Month-day        America      yaqob         NaN       400.0
3  Year-Month-day  United States     Yaqoob       400.0       250.0

## **Naming Convention Issues**

In [174]:
country={"USA":"United States","U.S.A.":"United States","America":"United States"}
df_data['country']=df_data['country'].replace(country)
df_data

             date        country       name  sales_2020  sales_2021
0      2022-12-01  United States   Shahzaib       200.0         NaN
1  Year-Month-day  United States  shaahzaib       300.0       250.0
2  Year-Month-day  United States      yaqob         NaN       400.0
3  Year-Month-day  United States     Yaqoob       400.0       250.0

## **Typographical Errors**

In [175]:
Name={"shaahzaib":"Shahzaib","yaqob":"Yaqoob"}
df_data["name"]=df_data['name'].replace(Name)
df_data

             date        country      name  sales_2020  sales_2021
0      2022-12-01  United States  Shahzaib       200.0         NaN
1  Year-Month-day  United States  Shahzaib       300.0       250.0
2  Year-Month-day  United States    Yaqoob         NaN       400.0
3  Year-Month-day  United States    Yaqoob       400.0       250.0

## **Duplication of Data**

In [176]:
# df_data.drop_duplicates(subset='name')

## **Contradictory Data**

In [177]:
df_data.drop(df_data[df_data['sales_2020']>=df_data['sales_2021']].index)

             date        country      name  sales_2020  sales_2021
0      2022-12-01  United States  Shahzaib       200.0         NaN
2  Year-Month-day  United States    Yaqoob         NaN       400.0